import Card from "../../components/Card";
export default function IntroductionPage() {
  const characters = {
    Walter: {
      description:
        "เจ้าหน้าที่สืบสวนอาชญากรรมหนุ่ม ผู้เฉียบแหลมและช่างสังเกต แม้จะไม่มีใครกล้าแตะต้องคดีของตระกูล Crimson แต่เขากลับเลือกที่จะเดินหน้าเปิดโปงความจริงอย่างไม่ลังเล ด้วยไหวพริบอันเหนือชั้นและทักษะการสืบสวนที่ไร้เทียมทาน เป้าหมายของเขาคือการเปิดโปงคนร้ายตัวจริง ไม่ว่าจะต้องเผชิญหน้ากับอันตรายเพียงใด!",
      srcImage: "walter-p.png",
    },
    "Viscountess Scarlet Crimson": {
      description:
        "ภรรยาของ Viscount Rufous ผู้เทิดทูนสามีและให้ความสำคัญกับศักดิ์ศรีของตระกูลเหนือสิ่งอื่นใด เธอคือหญิงผู้สง่างามและเปี่ยมอำนาจ พร้อมทำทุกวิถีทางเพื่อรักษาภาพลักษณ์อันสมบูรณ์แบบของตระกูล แม้ว่านั่นจะหมายถึงการก้าวข้ามเส้นแบ่งของความถูกต้องก็ตาม…",
      srcImage: "scarlet-p.png",
    },
    "Lord Phoenix Crimson": {
      description: `บุตรชายคนโตของตระกูล  เติบโตในฝรั่งเศสตั้งแต่เด็ก ฉลาดหลักแหลม หลงใหลในพฤกษศาสตร์ มีทักษะการเจรจาชั้นยอด ด้วยเสน่ห์และบุคลิกที่โดดเด่น จึงเป็นที่จับตามองในทุกงานสังคม 
                        เขารักชีวิตอิสระยิ่งกว่าสิ่งใด แต่ในฐานะพี่ชายคนโต ความคาดหวังจากพ่อและตระกูลกลับเป็นสิ่งที่เขาไม่อาจหลีกหนีได้
                        `,
      srcImage: "Pheonix-p.png",
    },
    "Lord Garnet Crimson": {
      description: `ลูกชายคนกลางแห่งตระกูล ด้วยนิสัยที่เงียบขรึม เก็บตัวและรูปร่างที่ผอมบางไม่ตรงกับค่านิยมของสังคม จึงไม่ได้รับความสนใจหรือความคาดหวังจากใคร เขาจึงหันไปหลงใหลในงานศิลปะ ซึ่งกลายเป็นโลกส่วนตัวที่เขาสามารถแสดงออกถึงความคิดและจินตนาการได้อย่างเต็มที่`,
      srcImage: "garnet-p.png",
    },
    "Lady Ruby Crimson": {
      description:
        "ลูกสาวคนเล็ก ผู้เป็นผู้เป็นดั่งแก้วตาดวงใจของทุกคนในบ้าน ภายนอกที่ดูน่ารัก สดใส แต่กลับแปรเปลี่ยนเป็นความน่ากลัวได้ในชั่วพริบตา อีกทั้งงานอดิเรกสุดแปลกของเธอที่ใครเห็นเป็นต้องขนลุกซู่…",
      srcImage: "ruby-p.png",
    },
    "Merlot Crimson": {
      description:
        "พี่ชายของ Viscount Rufous ผู้เปี่ยมด้วยความสามารถและประสบการณ์ในชีวิต เขารักหลานยิ่งกว่าสิ่งใดและมักใช้เวลาสอนศิลปะให้เสมอ อันเป็นสิ่งที่เขารัก ทว่าเมื่อต้องใช้ชีวิตในห้องขัง จุดต่ำสุดของชีวิตก็มาถึง ทำให้เขาจมอยู่กับความผิดหวัง มองว่าตนเองล้มเหลวและไร้จุดหมาย แม้จะเป็นอิสระแล้วก็ตาม",
      srcImage: "Merlot-p.png",
    },
    "Richard Hargrave": {
      description:
        "นักเขียนอุปถัมภ์แห่งตระกูล Crimson ผู้รับหน้าที่ถ่ายทอดเรื่องราวของตระกูลสู่สังคม ด้วยเสน่ห์วาทศิลป์อันเฉียบคม เขาเป็นชายผู้มั่นใจในตัวเองอย่างล้นเหลือ ทะเยอทะยานจนยากจะหยุดยั้ง แต่เบื้องหลังปลายปากกานั้น เขาคือผู้กุมความลับของตระกูล และพร้อมจะเปิดโปงทุกอย่างได้ทุกเมื่อ",
      srcImage: "Richard-p.png",
    },
    "Mary Collins": {
      description:
        "สาวใช้ผู้รับใช้ตระกูลมานานจนรู้ทุกความลับ แต่สิ่งที่เธอทำได้ดีที่สุดคือ เปิดเผย มากกว่า ปกปิด ปากไว เม้าท์เก่ง อยากรู้อยากเห็นเป็นที่หนึ่ง ไม่มีวงสนทนาไหนขาดเธอได้ ซุ่มซ่ามจนใคร ๆ เอือม แต่ภายใต้ท่าทีโก๊ะ ๆ นั้น เธอกลับมีหัวใจที่เด็ดเดี่ยว มุ่งมั่นต่อสู้เพื่อสิทธิของชนชั้นล่างอย่างไม่ยอมแพ้",
      srcImage: "mary-p.png",
    },
  };
  return (
    <div className="min-h-screen bg-[url('/image/red_bg.jpg')] bg-cover text-[#E8D1A7] max-w-screen flex flex-col py-24 lg:px-40 md:px-32 sm:px-20 px-4 space-y-8 lg:space-y-12">
      <h1 className="text-2xl lg:text-3xl font-bold tracking-wide">The Project</h1>
      <div className="text-base lg:text-lg leading-relaxed">
        Crim(e)son House ไวเคานต์ผู้ล่วงลับ เป็นโปรเจกต์ละครเวทีปริญญานิพนธ์
        ที่สร้างสรรค์ขึ้นโดยกลุ่มนิสิตภาควิชาวาทวิทยาและสื่อสารการแสดง
        สาขาสื่อสารการแสดง คณะนิเทศศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย
        พวกเราต้องการให้ละครเวทีเรื่องนี้เป็นกระจกสะท้อนสังคม
        เปิดมุมมองเรื่องการให้โอกาสที่สองแก่กลุ่มผู้ที่เคยกระทำผิดและได้ชดใช้ความผิดแล้ว
        เพื่อให้พวกเขาได้กลับมาใช้ชีวิตอย่างมีคุณค่า โดยไม่ถูกตีตราหรือแบ่งแยก
        เพราะเราเชื่อว่าทุกชีวิตสามารถเริ่มต้นใหม่และเป็นส่วนหนึ่งที่ดีของสังคมได้
      </div>

      <h1 className="text-2xl lg:text-3xl font-bold tracking-wide">Synopsis</h1>
      <div className="text-base lg:text-lg leading-relaxed">
        ในช่วงยุค Regency ปี 1816 ณ คฤหาสน์ &#39;ตระกูล Crimson&#39;
        ตระกูลผู้ดีเก่าแก่ที่ทรงอิธิพลเป็นอันดับต้น ๆ ของกรุงลอนดอน
        ได้เกิดเหตุอันน่าเศร้าสลด เมื่อ ไวเคานต์ &#39;Rufous Crimson&#39;
        ผู้นำของตระกูลถูกพบเป็นศพอยู่ภายในห้องพักส่วนตัว
        เจ้าหน้าที่ได้ลงความเห็นว่าเป็นการเสียชีวิตโดยธรรมชาติ แต่ทว่า
        หลังจากเกิดเหตุได้อาทิตย์กว่า ๆ ลูกชายคนกลางของตระกูล อย่าง &#39;Lord
        Garnet Crimson&#39; กลับเข้ารับสารภาพว่าตนเองคือฆาตกร
        และไม่ยอมปริปากอันใดอีกเลย คดีนี้ดันไปสะดุดตา &#39;Walter&#39;
        เจ้าหน้าที่สืบสวนอาชญากรรมที่มองว่าคดีนี้มีเหตุไม่ชอบมาพากล
        อีกทั้งครอบครัวที่ดูไม่สนใจใยดี แถมยังถีบส่ง Garnet เข้าคุก
        เขาจึงเริ่มดำเนินแผนการสืบ
        ด้วยการใช้งานประมูลของตระกูลที่ถูกจัดขึ้นทุกปี
        เพื่อให้เหล่าผู้ต้องสงสัยได้มารวมตัวกันโดยไม่อาจหลีกเลี่ยง
        และนี่คือโอกาสของ Walter ที่จะได้เริ่มเปิดโปงความลับของตระกูล Crimson
      </div>

      <h1 className="text-2xl lg:text-3xl font-bold tracking-wide">Characters</h1>
      <div className="flex flex-wrap gap-10 gap-y-10 justify-center">
        {Object.entries(characters).map(([name, decsriptions]) => (
          <Card
            name={name}
            key={name}
            imageSrc={`/image/${decsriptions.srcImage}`}
            description={decsriptions.description}
          />
        ))}
      </div>
    </div>
  );
}
