import Article from "@/components/Article";
export default function OurStoryPage() {
  return (
    <div className="max-h-screen max-w-screen bg-[url('/image/red_bg.jpg')] text-[#E8D1A7] bg-cover flex flex-col py-50 lg:px-40 md:px-32 sm:px-20 px-4 space-y-4 lg:space-y-10 ">
      <h1 className="font-bold">Topic :  Inclusivity</h1>
      <div>
        หมายถึง การเปิดรับและให้พื้นที่กับทุกคนอย่างเท่าเทียม ไม่แบ่งแยก ไม่กีดกัน เพื่อให้ทุกเสียงและตัวตนมีคุณค่า <br/>
        โดยเราสนใจประเด็นเรื่อง “การให้โอกาสที่สองกับกลุ่มอาชญากรที่ผ่านการรับโทษแล้ว”<br/><br/>
        <h1 className="font-bold text-l">อาชญากร (Criminal) <br/></h1>
        FYI : ประเทศไทยมีอัตราการกระทำผิดซ้ำของอาชญากรภายใน 1 ปี หลังพ้นโทษแล้ว มากถึง 18.26% (ข้อมูลสถิติของปี 2567)  จาก กรมราชทัณฑ์ กระทรวงยุติธรรม<br/>
        สังคมไทยมักตีตราอาชญากรในทางลบ ทำให้ไม่มีพื้นที่ในสังคม และอาจกลับไปก่อความผิดซ้ำ<br/><br/>
        <ul><u><b>เหตุผลหลัก ๆ ที่อาชญากรเลือกกระทำผิดซ้ำ</b></u><br/></ul>
        <li>ขาดโอกาสในการทำงาน → ไม่มีทางเลือก → กลับไปสู่อาชญากรรม</li>
        <li>ขาดการสนับสนุนจากครอบครัวและชุมชน → ไม่มีที่พึ่ง → หันกลับไปหาสังคมเดิม</li>
        <li>สังคมไม่เปิดโอกาสให้เริ่มต้นใหม่ → รู้สึกไร้ค่า → สูญเสียแรงจูงใจในการปรับตัว</li>
        <li>ความเครียดและปัญหาสุขภาพจิต → กระตุ้นให้ทำผิดอีกครั้ง<br/></li>
        <li>ละครเวทีเรื่อง Crimeson House ไวเคานต์ผู้ล่วงลับ</li><br/><br/>
       <q className="font-bold">Sometimes, a second chance is all someone needs to change their whole story.</q> <br/>
        บางครั้ง โอกาสที่สองคือสิ่งเดียวที่ใครบางคนต้องการ เพื่อเขียนเรื่องราวชีวิตใหม่ 

      </div>
      <h1 className="font-bold">Topic :  Inclusivity</h1>
      <div>
        ละครเวทีที่ผู้ชมมีส่วนร่วมกับการแสดง โดยที่ผู้ชมสามารถเลือกเดินไปยังสถานที่หรือเส้นทางต่าง ๆ และยังสามารถพูดคุยกับนักแสดงได้ในบางช่วงของการแสดง ทำให้ทุกคนมีส่วนร่วมกับเรื่องราวของตัวละครอย่างใกล้ชิด
        Crim(e)son House ไวเคานต์ผู้ล่วงลับ คือ ละครเวทีรูปแบบ <b>Interactive Immersive theatre</b> ที่จะพาผู้ชมร่วมสืบหาความจริงของคดีฆาตกรรมไปพร้อม ๆ กับตัวละครของเรื่อง พวกเราจะพาคุณหลุดเข้ามายังคฤหาสน์ของตระกูล Crimson ในปี ค.ศ.1816 
      </div>
    
    </div>
  );
}
